tap "derailed/k9s"
tap "hashicorp/tap"
tap "heroku/brew"
tap "jakehilborn/jakehilborn"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
# Search tool like grep, but optimized for programmers
brew "ack"
# Run your GitHub Actions locally
brew "act"
# ANSI HTML adapter
brew "aha"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Spell checker with better logic than ispell
brew "aspell"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Bash completion for Bundler
brew "bundler-completion"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line tool for DigitalOcean
brew "doctl"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Secure your credentials in environment variables
brew "envchain"
# Cloud-native high-performance edge/middle/service proxy
brew "envoy"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# I/O benchmark and stress test
brew "fio"
# Bash completion for gem
brew "gem-completion"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Bash completion for Launchctl
brew "launchctl-completion"
# Mac App Store command-line interface
brew "mas"
# Terminal-based visual file manager
brew "midnight-commander"
# Run a Kubernetes cluster locally
brew "minikube"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Bash completion for open
brew "open-completion"
# Provides a software solution to manage, store, and distribute sensitive data
brew "openbao"
# OpenShift command-line interface tools
brew "openshift-cli"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Bash completion for Pip
brew "pip-completion"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Show ps output as a tree
brew "pstree"
# Password generator
brew "pwgen"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Makes shims aware of bundle install paths
brew "rbenv-bundler"
# Auto-installs gems for Ruby installs
brew "rbenv-default-gems"
# Rsync for cloud storage
brew "rclone"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Utility that provides fast incremental file transfer
brew "rsync"
# Bash completion for Ruby
brew "ruby-completion"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Zsh prompt for Astronauts
brew "spaceship"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "talosctl"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tool for managing your YubiKey configuration
brew "ykman"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Packer
brew "hashicorp/tap/packer"
# Vault
brew "jakehilborn/jakehilborn/displayplacer"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Menu bar icon organiser
cask "bartender"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-fira-code-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your emails and files
cask "gpg-suite"
# System monitoring app
cask "istat-menus"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# End-to-end encryption software
cask "logitech-g-hub"
# Software for Logitech devices
cask "logi-options+"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Open source virtual/remote desktop application
cask "rustdesk"
# Tool to format memory cards complying with the SD File System spec
cask "sdformatter"
# Team communication and collaboration software
cask "slack"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Unpacks archive files
cask "the-unarchiver"
# Batch image thumbnail generation utility
cask "thumbsup"
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "AdGuard Mini", id: 1440147259
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Display Menu", id: 549083868
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "LanguageTool", id: 1534275760
mas "Momentum", id: 1564329434
mas "Remote Desktop", id: 409907375
mas "Screens 5", id: 1663047912
mas "Windows App", id: 1295203466
