tap "hashicorp/security", "git@github.com:hashicorp/homebrew-security.git"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "minio/stable"
tap "pingidentity/devops"
tap "puppetlabs/puppet"
tap "romkatv/powerlevel10k"
brew "ack"
brew "act"
brew "glib"
brew "pkg-config"
brew "python@3.9"
brew "harfbuzz"
brew "pango"
brew "adwaita-icon-theme"
brew "python@3.10"
brew "ansible"
brew "ansible-lint"
brew "arduino-cli"
brew "aspell"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "brew-cask-completion"
brew "btop"
brew "bundler-completion"
brew "ccze"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "cowsay"
brew "direnv"
brew "docker", link: false
brew "doctl"
brew "eksctl"
brew "envchain"
brew "gobject-introspection"
brew "libass"
brew "ffmpeg@4"
brew "fio"
brew "gem-completion"
brew "git"
brew "git-extras"
brew "git-secrets"
brew "libusb"
brew "go"
brew "gpsbabel"
brew "graphviz"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "handbrake"
brew "helm"
brew "htop"
brew "hub"
brew "hugo"
brew "ipcalc"
brew "iperf"
brew "iperf3"
brew "jq"
brew "kubernetes-cli"
brew "launchctl-completion"
brew "libpq"
brew "libslirp"
brew "libssh"
brew "libssh2"
brew "libvirt"
brew "mackup"
brew "mas"
brew "midnight-commander"
brew "minikube"
brew "ncdu"
brew "nmap"
brew "open-completion"
brew "openshift-cli"
brew "packer"
brew "packer-completion"
brew "pidgin"
brew "pip-completion"
brew "pre-commit"
brew "pstree"
brew "pwgen"
brew "python@3.8"
brew "qemu"
brew "rake-completion"
brew "ruby-build"
brew "rbenv"
brew "rbenv-bundler"
brew "rbenv-default-gems"
brew "rmlint"
brew "rsync"
brew "ruby-completion"
brew "s3cmd"
brew "screen"
brew "skopeo"
brew "softhsm"
brew "spaceship"
brew "sphinx-doc"
brew "sshuttle"
brew "switchaudio-osx"
brew "telnet"
brew "terraform-docs"
brew "terraform-provider-libvirt"
brew "tflint"
brew "tfsec"
brew "tmux"
brew "travis"
brew "tree"
brew "vagrant-completion"
brew "vice"
brew "vim"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "ykman"
brew "youtube-dl"
brew "hashicorp/security/doormat-cli"
brew "hashicorp/tap/boundary", link: false
brew "hashicorp/tap/waypoint", link: false
brew "heroku/brew/heroku"
brew "jakehilborn/jakehilborn/displayplacer"
brew "minio/stable/minio"
brew "pingidentity/devops/ping-devops"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "airfoil"
cask "alfred"
cask "android-file-transfer"
cask "appcleaner"
cask "arduino"
cask "autodesk-fusion360"
cask "db-browser-for-sqlite"
cask "deckset"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "freecad"
cask "fujifilm-x-acquire"
cask "fujifilm-x-raw-studio"
cask "fujifilm-x-webcam"
cask "garmin-express"
cask "gog-galaxy"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "handbrake"
cask "hashicorp-boundary-desktop"
cask "hyper"
cask "insta360-studio"
cask "intel-power-gadget"
cask "istat-menus"
cask "iterm2"
cask "jitsi-meet"
cask "keepingyouawake"
cask "keybase"
cask "keycastr"
cask "logitech-gaming-software"
cask "logitech-options"
cask "loopback"
cask "macs-fan-control"
cask "microsoft-teams"
cask "muzzle"
cask "nosleep"
cask "obs"
cask "obsidian"
cask "omnidisksweeper"
cask "onyx"
cask "openscad"
cask "oracle-jdk"
cask "pdk"
cask "prusaslicer"
cask "puppet-bolt"
cask "raspberry-pi-imager"
cask "rectangle"
cask "resilio-sync"
cask "screenflow"
cask "sdformatter"
cask "shimo"
cask "signal"
cask "skype"
cask "slack"
cask "spotify"
cask "steam"
cask "teamviewer"
cask "telegram"
cask "the-unarchiver"
cask "thumbsup"
cask "transmission-remote-gui"
cask "vagrant"
cask "vagrant-manager"
cask "viber"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
cask "vlc"
cask "wacom-tablet"
cask "zoom"
mas "Apple Configurator", id: 1037126344
mas "BaseCamp", id: 411052274
mas "Blackmagic RAW Speed Test", id: 1466185689
mas "DaVinci Resolve", id: 571213070
mas "Disk Speed Test", id: 425264550
mas "Display Menu", id: 549083868
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Evernote", id: 406056744
mas "GarageBand", id: 682658836
mas "GoldenHour", id: 1506521630
mas "HP Smart", id: 1474276998
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "LanguageTool", id: 1534275760
mas "Marked 2", id: 890031187
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Momentum", id: 1564329434
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "OmniFocus", id: 867299399
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Remote Desktop", id: 409907375
mas "Telegram", id: 747648890
mas "Up Next", id: 1355117041
mas "We-Row - NOHrD", id: 1249969344
